## Plan Result (Staging)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 9 to destroy.</code></pre>

* Delete
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;afdverify.test&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;signalr&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;test&#34;]
* Replace
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;admin&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;afdverify.admin&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;afdverify.video&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;video&#34;]
  * module.hearings-reform.azurerm_dns_zone.zone
  * module.hearings-reform.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hearings-reform.azurerm_dns_cname_record.this["admin"] must be replaced
-/+ resource "azurerm_dns_cname_record" "this" {
      ~ fqdn                = "admin.staging.hearings.reform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/admin" -> (known after apply)
        name                = "admin"
      - tags                = {} -> null
      ~ zone_name           = "staging.hearings.reform.hmcts.net" -> "staging.hearings.hmcts.net" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["afdverify.admin"] must be replaced
-/+ resource "azurerm_dns_cname_record" "this" {
      ~ fqdn                = "afdverify.admin.staging.hearings.reform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/afdverify.admin" -> (known after apply)
        name                = "afdverify.admin"
      - tags                = {} -> null
      ~ zone_name           = "staging.hearings.reform.hmcts.net" -> "staging.hearings.hmcts.net" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["afdverify.test"] will be destroyed
  # (because key ["afdverify.test"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "afdverify.test.staging.hearings.reform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/afdverify.test" -> null
      - name                = "afdverify.test" -> null
      - record              = "afdverify.sdshmcts-stg-abfwhrf8g0btcqhe.z01.azurefd.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "staging.hearings.reform.hmcts.net" -> null
        # (1 unchanged attribute hidden)
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["afdverify.video"] must be replaced
-/+ resource "azurerm_dns_cname_record" "this" {
      ~ fqdn                = "afdverify.video.staging.hearings.reform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/afdverify.video" -> (known after apply)
        name                = "afdverify.video"
      - tags                = {} -> null
      ~ zone_name           = "staging.hearings.reform.hmcts.net" -> "staging.hearings.hmcts.net" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["signalr"] will be destroyed
  # (because key ["signalr"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "signalr.staging.hearings.reform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/signalr" -> null
      - name                = "signalr" -> null
      - record              = "vh-infra-core-stg.service.signalr.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "staging.hearings.reform.hmcts.net" -> null
        # (1 unchanged attribute hidden)
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["test"] will be destroyed
  # (because key ["test"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "test.staging.hearings.reform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/test" -> null
      - name                = "test" -> null
      - record              = "sdshmcts-stg-abfwhrf8g0btcqhe.z01.azurefd.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "staging.hearings.reform.hmcts.net" -> null
        # (1 unchanged attribute hidden)
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["video"] must be replaced
-/+ resource "azurerm_dns_cname_record" "this" {
      ~ fqdn                = "video.staging.hearings.reform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/CNAME/video" -> (known after apply)
        name                = "video"
      - tags                = {} -> null
      ~ zone_name           = "staging.hearings.reform.hmcts.net" -> "staging.hearings.hmcts.net" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.hearings-reform.azurerm_dns_zone.zone must be replaced
-/+ resource "azurerm_dns_zone" "zone" {
      ~ id                        = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net" -> (known after apply)
      ~ max_number_of_record_sets = 10000 -> (known after apply)
      ~ name                      = "staging.hearings.reform.hmcts.net" -> "staging.hearings.hmcts.net" # forces replacement
      ~ name_servers              = [
          - "ns1-06.azure-dns.com.",
          - "ns2-06.azure-dns.net.",
          - "ns3-06.azure-dns.org.",
          - "ns4-06.azure-dns.info.",
        ] -> (known after apply)
      ~ number_of_record_sets     = 11 -> (known after apply)
      - tags                      = {} -> null
        # (1 unchanged attribute hidden)

      ~ soa_record {
          + id                        = (known after apply)
          + max_number_of_record_sets = (known after apply)
          + name                      = (known after apply)
          + name_servers              = (known after apply)
          + number_of_record_sets     = (known after apply)
          + resource_group_name       = (known after apply)
          + tags                      = (known after apply)
        } -> (known after apply)
    }

  # module.hearings-reform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/d639e78a-b7b4-1da9-bfb0-1c934fbe4914" -> (known after apply)
      ~ name                                   = "d639e78a-b7b4-1da9-bfb0-1c934fbe4914" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1822,"Program":"tfcmt","SHA1":"","Target":"Staging","Vars":{}} -->